2d_orifice_flow_sim/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xmin    -20;
xmax    250;
ymin    -20;
ymax    20;
zmin    -20;
zmax    20;

numBlocksX  20;
numBlocksY  20;
numBlocksZ  100;

vertices
    (
        ($xmin $ymin $zmin)
        ($xmin $ymax $zmin)
        ($xmin $ymax $zmax)
        ($xmin $ymin $zmax)
        ($xmax $ymin $zmin)
        ($xmax $ymax $zmin)
        ($xmax $ymax $zmax)
        ($xmax $ymin $zmax) 
    );
 

blocks
    (
    hex (0 1 2 3 4 5 6 7 )
    ($numBlocksX $numBlocksY $numBlocksZ)
    simpleGrading (1 1 1 )
    );


edges
(
);

boundary
(
   
);


// ************************************************************************* //
