2d_orifice_flow_sim/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    wall1
    {
        type            zeroGradient;
    }

    // frontAndBack
    // {
    //     type            empty;
    // }
    
    inlet
    {
        // type zeroGradient;
        type            fixedValue;
        value           uniform 115000;    
    }

    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
}


// ************************************************************************* //
