2d_orifice_flow_sim/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{

    wall1
    {
        type            zeroGradient;
    }


    inlet
    {
        type            fixedValue;
        value           uniform 293;
    }

    outlet
    {
        // type            inletOutlet;
        // value           $internalField;
        type            fixedValue;
        value           uniform 293;
    }
}


// ************************************************************************* //
