2d_orifice_flow_sim/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0; //0

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0; //0
    }

    outlet
    {
        type            zeroGradient;
    }

    wall1
    {
        type            zeroGradient;
    }

    // lowerWall
    // {
    //     type            zeroGradient;
    // }

    // frontAndBack
    // {
    //     type            empty;
    // }
}


// ************************************************************************* //
